# инициализация гита в папке
# git init

#  Добавить файл в индекс
# git add <файл>

#  Добавить все файлы в индекс
# git add .

#  Удалить файл из индекса
# git rm --cached <файл>

#  Проверить статус файлов
#  git status

# # Создать коммит
# git commit -m "Сообщение коммита"

# # Просмотр истории коммитов
# git log

# # Просмотр изменений,статус
# git status

# Создать новую ветку
# git branch <имя_ветки>

# # Переключиться на ветку
# git checkout <имя_ветки>

# # Создать и переключиться на новую ветку
# git checkout -b <имя_ветки>

# # Просмотр всех веток
# git branch

# # Удалить ветку
# git branch -d <имя_ветки>

# # Добавить удаленный репозиторий
# git remote add origin <url>

# # Отправить изменения на сервер
# git push origin <ветка>

# # Получить изменения с сервера
# git pull origin <ветка>

# # Клонировать репозиторий
# git clone <url>

# # Отменить изменения в файле
# git checkout -- <файл>

# # Отменить индексацию файла
# git reset HEAD <файл>

# # Исправить последний коммит
# git commit --amend

# # Просмотр информации о репозитории
# git remote -v

# # Просмотр изменений в коммите
# git show <хэш_коммита>

# # Слияние веток
# git merge <ветка>